import sys, re
sys.stdout.reconfigure(encoding='utf-8')
from translator import *

arabic_text =  """شهد الطب تطورًا مذهلاً في العقود القليلة الماضية بفضل التقدم التكنولوجي والاكتشافات العلمية. 
أدت هذه التطورات إلى تحسين طرق التشخيص والعلاج، وزيادة معدلات الشفاء من العديد من الأمراض التي كانت تعتبر مستعصية في الماضي. 
أصبح بإمكان الأطباء الآن استخدام تقنيات مثل الذكاء الاصطناعي والروبوتات في العمليات الجراحية، مما زاد من دقة الإجراءات الطبية وسرعة تعافي المرضى. 
كما ساعدت تطبيقات الصحة الرقمية في تمكين الأفراد من مراقبة حالتهم الصحية بشكل مستمر. 
ومع ذلك، لا تزال هناك تحديات تتعلق بتكلفة الرعاية الصحية وإمكانية الوصول إليها للجميع، مما يتطلب حلولًا مبتكرة وسياسات عادلة لضمان استفادة الجميع من هذه الإنجازات"""

translated_text = translate_long_text(arabic_text, chunk_size=300, batch_size=6)
print("\nTranslated Text:\n", translated_text)
